In [66]:
import pandas as pd
import os
os.chdir("/home/abhisek/Studies/Coursera/Regression/week2")

In [67]:
df_train=pd.read_csv("kc_house_train_data.csv")
df_train.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,bedrooms_squared,bed_bath_rooms,log_sqft_living,lat_plus_long
0,7129300520,20141013T000000,221900,3,1.00,1180,5650,1.0,0,0,...,0,98178,47.5112,-122.257,1340,5650,9,3.00,3.071882,-74.7458
1,6414100192,20141209T000000,538000,3,2.25,2570,7242,2.0,0,0,...,1991,98125,47.7210,-122.319,1690,7639,9,6.75,3.409933,-74.5980
2,5631500400,20150225T000000,180000,2,1.00,770,10000,1.0,0,0,...,0,98028,47.7379,-122.233,2720,8062,4,2.00,2.886491,-74.4951
3,2487200875,20141209T000000,604000,4,3.00,1960,5000,1.0,0,0,...,0,98136,47.5208,-122.393,1360,5000,16,12.00,3.292256,-74.8722
4,1954400510,20150218T000000,510000,3,2.00,1680,8080,1.0,0,0,...,0,98074,47.6168,-122.045,1800,7503,9,6.00,3.225309,-74.4282

In [68]:
X_train=df_train.loc[:,["bedrooms_squared","bed_bath_rooms","log_sqft_living","lat_plus_long"]]
X_train.head()
#X_train.shape

   bedrooms_squared  bed_bath_rooms  log_sqft_living  lat_plus_long
0                 9            3.00         3.071882       -74.7458
1                 9            6.75         3.409933       -74.5980
2                 4            2.00         2.886491       -74.4951
3                16           12.00         3.292256       -74.8722
4                 9            6.00         3.225309       -74.4282

In [69]:
df_test=pd.read_csv("kc_house_test_data.csv")
df_test.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,bedrooms_squared,bed_bath_rooms,log_sqft_living,lat_plus_long
0,114101516,20140528T000000,310000,3,1.0,1430,19901,1.5,0,0,...,0,98028,47.7558,-122.229,1780,12697,9,3.0,7.265430,-74.4732
1,9297300055,20150124T000000,650000,4,3.0,2950,5000,2.0,0,3,...,0,98126,47.5714,-122.375,2140,4000,16,12.0,7.989560,-74.8036
2,1202000200,20141103T000000,233000,3,2.0,1710,4697,1.5,0,0,...,0,98002,47.3048,-122.218,1030,4705,9,6.0,7.444249,-74.9132
3,8562750320,20141110T000000,580500,3,2.5,2320,3980,2.0,0,0,...,0,98027,47.5391,-122.070,2580,3980,9,7.5,7.749322,-74.5309
4,7589200193,20141110T000000,535000,3,1.0,1090,3000,1.5,0,0,...,0,98117,47.6889,-122.375,1570,5080,9,3.0,6.993933,-74.6861

In [70]:
X_test=df_test.loc[:,["bedrooms_squared","bed_bath_rooms","log_sqft_living","lat_plus_long"]]
X_test.head()
#X_test.shape

   bedrooms_squared  bed_bath_rooms  log_sqft_living  lat_plus_long
0                 9             3.0         7.265430       -74.4732
1                16            12.0         7.989560       -74.8036
2                 9             6.0         7.444249       -74.9132
3                 9             7.5         7.749322       -74.5309
4                 9             3.0         6.993933       -74.6861

In [71]:
X_test.mean()

bedrooms_squared    12.446678
bed_bath_rooms       7.503902
log_sqft_living      7.550275
lat_plus_long      -74.653334
dtype: float64

#### Model 1

In [72]:
X_model1=df_train.loc[:,["sqft_living","bedrooms","bathrooms","lat","long"]]
X_model1.head()

   sqft_living  bedrooms  bathrooms      lat     long
0         1180         3       1.00  47.5112 -122.257
1         2570         3       2.25  47.7210 -122.319
2          770         2       1.00  47.7379 -122.233
3         1960         4       3.00  47.5208 -122.393
4         1680         3       2.00  47.6168 -122.045

In [73]:
y=df_train.loc[:,["price"]]
y.head()
#y.shape

    price
0  221900
1  538000
2  180000
3  604000
4  510000

In [74]:
from sklearn.linear_model import LinearRegression
model1=LinearRegression()
model1.fit(X_model1,y)

LinearRegression()

In [75]:
y_predict1=model1.predict(X_model1)
y_predict1

array([[244657.18811044],
       [855689.66538486],
       [318101.67899464],
       ...,
       [528928.42823836],
       [356549.38348044],
       [317948.91207276]])

# Model 2

In [76]:
X_model2=df_train.loc[:,["sqft_living","bedrooms","bathrooms","lat","long","bed_bath_rooms"]]
X_model2.head()

   sqft_living  bedrooms  bathrooms      lat     long  bed_bath_rooms
0         1180         3       1.00  47.5112 -122.257            3.00
1         2570         3       2.25  47.7210 -122.319            6.75
2          770         2       1.00  47.7379 -122.233            2.00
3         1960         4       3.00  47.5208 -122.393           12.00
4         1680         3       2.00  47.6168 -122.045            6.00

In [77]:
model2=LinearRegression()
model2.fit(X_model2,y)

LinearRegression()

In [78]:
y_predict2=model2.predict(X_model2)
y_predict2

array([[251332.76667792],
       [839750.73997917],
       [354879.46307828],
       ...,
       [515931.6400157 ],
       [347955.13436442],
       [361864.55175637]])

#### Model 3

In [79]:
X_model3=df_train.loc[:,["sqft_living","bedrooms","bathrooms","lat","long","bed_bath_rooms","bedrooms_squared","log_sqft_living","lat_plus_long"]]
X_model3.head()

,sqft_living,bedrooms,bathrooms,lat,long,bed_bath_rooms,bedrooms_squared,log_sqft_living,lat_plus_long
0,1180,3,1.00,47.5112,-122.257,3.00,9,3.071882,-74.7458
1,2570,3,2.25,47.7210,-122.319,6.75,9,3.409933,-74.5980
2,770,2,1.00,47.7379,-122.233,2.00,4,2.886491,-74.4951
3,1960,4,3.00,47.5208,-122.393,12.00,16,3.292256,-74.8722
4,1680,3,2.00,47.6168,-122.045,6.00,9,3.225309,-74.4282

In [80]:
model3=LinearRegression()
model3.fit(X_model3,y)

LinearRegression()

In [81]:
y_predict3=model3.predict(X_model3)
y_predict3

array([[283863.95917706],
       [790213.23770399],
       [457872.03756941],
       ...,
       [534529.47321143],
       [360054.7571596 ],
       [343108.28060026]])

In [82]:
print("Model1_coef",model1.coef_)

Model1_coef [[ 3.12258646e+02 -5.95865332e+04  1.57067421e+04  6.58619264e+05
  -3.09374351e+05]]

In [83]:
print("Model2_coef",model2.coef_)

Model2_coef [[ 3.06610053e+02 -1.13446368e+05 -7.14613083e+04  6.54844630e+05
  -2.94298969e+05  2.55796520e+04]]

In [84]:
# RSS MODEL 1 (train)
((y-y_predict1)**2).sum()

price    9.678800e+14
dtype: float64

In [85]:
# RSS MODEL 2 (train)
((y-y_predict2)**2).sum()

price    9.584196e+14
dtype: float64

In [86]:
# RSS MODEL 3 (train)
((y-y_predict3)**2).sum()

price    9.034365e+14
dtype: float64

In [87]:
y_test=df_test.loc[:,["price"]]
y_test.head()
#y_test.shape

    price
0  310000
1  650000
2  233000
3  580500
4  535000

# Model 1 test

In [88]:
X_modeltest1=df_test.loc[:,["sqft_living","bedrooms","bathrooms","lat","long"]]
X_modeltest1.head()

   sqft_living  bedrooms  bathrooms      lat     long
0         1430         3        1.0  47.7558 -122.229
1         2950         4        3.0  47.5714 -122.375
2         1710         3        2.0  47.3048 -122.218
3         2320         3        2.5  47.5391 -122.070
4         1090         3        1.0  47.6889 -122.375

In [89]:
y_predicttest1=model1.predict(X_modeltest1)
y_predicttest1

array([[475157.63980062],
       [845336.99616413],
       [277856.39694324],
       ...,
       [600860.2106327 ],
       [593638.03562085],
       [318146.49785194]])

In [90]:
## RSS MODEL 1 Test
((y_test-y_predicttest1)**2).sum()

price    2.255005e+14
dtype: float64

# Model 2 Test

In [91]:
X_modeltest2=df_test.loc[:,["sqft_living","bedrooms","bathrooms","lat","long","bed_bath_rooms"]]
X_modeltest2.head()

   sqft_living  bedrooms  bathrooms      lat     long  bed_bath_rooms
0         1430         3        1.0  47.7558 -122.229             3.0
1         2950         4        3.0  47.5714 -122.375            12.0
2         1710         3        2.0  47.3048 -122.218             6.0
3         2320         3        2.5  47.5391 -122.070             7.5
4         1090         3        1.0  47.6889 -122.375             3.0

In [92]:
y_predicttest2=model2.predict(X_modeltest2)
y_predicttest2

array([[479919.90528331],
       [842029.3697058 ],
       [272476.15139482],
       ...,
       [595759.67616024],
       [586795.33002727],
       [362061.00514523]])

In [93]:
## RSS MODEL 2 test
((y_test-y_predicttest2)**2).sum()

price    2.233775e+14
dtype: float64

# Model 3 test

In [94]:
X_modeltest3=df_test.loc[:,["sqft_living","bedrooms","bathrooms","lat","long","bed_bath_rooms","bedrooms_squared","log_sqft_living","lat_plus_long"]]
X_modeltest3.head()

,sqft_living,bedrooms,bathrooms,lat,long,bed_bath_rooms,bedrooms_squared,log_sqft_living,lat_plus_long
0,1430,3,1.0,47.7558,-122.229,3.0,9,7.265430,-74.4732
1,2950,4,3.0,47.5714,-122.375,12.0,16,7.989560,-74.8036
2,1710,3,2.0,47.3048,-122.218,6.0,9,7.444249,-74.9132
3,2320,3,2.5,47.5391,-122.070,7.5,9,7.749322,-74.5309
4,1090,3,1.0,47.6889,-122.375,3.0,9,6.993933,-74.6861

In [95]:
y_predicttest3=model3.predict(X_modeltest3)
y_predicttest3

array([[-4854865.58892702],
       [-5024115.42184605],
       [-5197983.90606985],
       ...,
       [-5160627.0059437 ],
       [-5106740.42087381],
       [-4726510.96710562]])

In [96]:
## RSS Model 3 test
((y_test-y_predicttest3)**2).sum()

price    1.299109e+17
dtype: float64